# n школярів ділять k яблук порівну, залишок, що не ділиться, залишається в кошику.
# Скільки яблук дістанеться кожному школяру?
# Скільки яблук залишиться у кошику? n та k можна задати вручну. вивести 2 числа

schoolboy, apple = int(input('Введіть кількість школярів ')), int(input('Введіть кількість яблук '))

basket = apple % schoolboy
have_apple = apple // schoolboy

if apple < schoolboy:
    print('Якщо яблук менше за учнів, ніхто не отримає яблука')

print('В корзині залишилось', basket)
print('У кожного учня по', have_apple)
